; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v1 ?v4)
		(pred_4 ?v8)
		(pred_3 ?v6)
		(pred_2 ?v6)
		(pred_5 ?v8 ?v6)
		(pred_6)
		(pred_1 ?v8))

   (:action op_1
       :parameters  (?v5 ?v7)
       :precondition (and (not-eq ?v5 ?v7) 
                          (pred_3 ?v5) (pred_3 ?v7) (pred_2 ?v5))
       :effect (and  (pred_2 ?v7)
		     (not (pred_2 ?v5))))


   (:action op_3
       :parameters (?v2 ?v3)
       :precondition  (and  (pred_4 ?v2) (pred_3 ?v3)
			    (pred_5 ?v2 ?v3) (pred_2 ?v3) (pred_6))
       :effect (and (pred_1 ?v2)
		    (not (pred_5 ?v2 ?v3)) 
		    (not (pred_6))))

   (:action op_2
       :parameters  (?v2  ?v3)
       :precondition  (and  (pred_4 ?v2) (pred_3 ?v3)
			    (pred_1 ?v2) (pred_2 ?v3))
       :effect (and (pred_5 ?v2 ?v3)
		    (pred_6)
		    (not (pred_1 ?v2)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_07 obj_05 obj_06 obj_02 obj_08 obj_04 
          obj_01 obj_09 obj_03 
)
(:init
(pred_3 obj_07)
(pred_3 obj_05)
(pred_3 obj_06)
(pred_3 obj_02)
(pred_3 obj_08)
(pred_3 obj_04)
(pred_4 obj_01)
(pred_4 obj_09)
(pred_4 obj_03)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_08 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_08)
(pred_6)
(pred_5 obj_01 obj_05)
(pred_5 obj_09 obj_04)
(pred_5 obj_03 obj_08)
(pred_2 obj_08)
)
(:goal
(and
(pred_5 obj_01 obj_05)
(pred_5 obj_09 obj_04)
(pred_5 obj_03 obj_07)
)
)

(:constraints
  (sometime-before  (pred_5 obj_03 obj_07) (pred_2 obj_05))
)
)

; plan
1. (op_1 obj_08 obj_05)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_05)
   goals met: 2 of 3
2. (op_3 obj_01 obj_05)
   deleted: (pred_5 obj_01 obj_05) (pred_6)
   added: (pred_1 obj_01)
   goals met: 1 of 3
3. (op_1 obj_05 obj_08)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_08)
   goals met: 1 of 3
4. (op_2 obj_01 obj_08)
   deleted: (pred_1 obj_01)
   added: (pred_5 obj_01 obj_08) (pred_6)
   goals met: 1 of 3
5. (op_3 obj_03 obj_08)
   deleted: (pred_5 obj_03 obj_08) (pred_6)
   added: (pred_1 obj_03)
   goals met: 1 of 3
6. (op_1 obj_08 obj_07)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_07)
   goals met: 1 of 3
7. (op_2 obj_03 obj_07)
   deleted: (pred_1 obj_03)
   added: (pred_5 obj_03 obj_07) (pred_6)
   goals met: 2 of 3
8. (op_1 obj_07 obj_08)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_08)
   goals met: 2 of 3
9. (op_3 obj_01 obj_08)
   deleted: (pred_5 obj_01 obj_08) (pred_6)
   added: (pred_1 obj_01)
   goals met: 2 of 3
10. (op_1 obj_08 obj_05)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_05)
   goals met: 2 of 3
11. (op_2 obj_01 obj_05)
   deleted: (pred_1 obj_01)
   added: (pred_5 obj_01 obj_05) (pred_6)
   goals met: 3 of 3
